docs/function_ontology.md
```mermaid
classDiagram 
   class ConceptualObject~core~{
   } 
   class Application~common~{
   } 
   class Function~function~{
       argument string
   } 
   class Result~function~{
       returnValue string
   } 
   Function --> Result : output
   Function --|> Application
   Result --|> ConceptualObject

```  
